In [2]:
import numpy as np 
import pandas as pd

In [3]:
df1 = pd.DataFrame() 
df2 = pd.DataFrame()

In [4]:
df1['viewers'] = ["Sushmita", "Adam", "Benny", "Anurag"]
df2['users'] = ["Adam", "Anurag", "Benny", "Sushmita", "Apoorva"]

In [5]:
np.random.seed(1729)
df1 = df1.assign(views = np.random.normal(100, 100, 4)) 
df2 = df2.assign(cost = [20, np.nan, 15, 2, 7])

In [6]:
df1.head()

    viewers       views
0  Sushmita   31.266056
1      Adam   17.900529
2     Benny  265.236086
3    Anurag   42.470696

In [7]:
df2.head()

      users  cost
0      Adam  20.0
1    Anurag   NaN
2     Benny  15.0
3  Sushmita   2.0
4   Apoorva   7.0

In [8]:
df = df1.merge(df2, left_on="viewers", right_on="users", how="left") 
df.head()

    viewers       views     users  cost
0  Sushmita   31.266056  Sushmita   2.0
1      Adam   17.900529      Adam  20.0
2     Benny  265.236086     Benny  15.0
3    Anurag   42.470696    Anurag   NaN

In [12]:
df=df.fillna(df.mean())

In [10]:
df['Gender'] = ["Female", "Male", "Male", "Female"]

In [13]:
df

    viewers       views     users       cost  Gender
0  Sushmita   31.266056  Sushmita   2.000000  Female
1      Adam   17.900529      Adam  20.000000    Male
2     Benny  265.236086     Benny  15.000000    Male
3    Anurag   42.470696    Anurag  12.333333  Female

In [16]:
df['Gender']=df['Gender'].map({"Female":"F","Male":"M"})

In [17]:
df['Gender']

0    F
1    M
2    M
3    F
Name: Gender, dtype: object

In [18]:
df[['views','cost']].apply(lambda x: round(x,2), axis=1)

    views   cost
0   31.27   2.00
1   17.90  20.00
2  265.24  15.00
3   42.47  12.33

In [19]:
df.groupby('Gender')['cost'].sum()

Gender
F    14.333333
M    35.000000
Name: cost, dtype: float64